# data-database-types-relational-language-SQL-MySQL-CR_U_D-update-command-UPDATE-SET
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **update** **existing** **rows** - records - tuples - in a **table** - entity - relation [1]

```sql
UPDATE <table> SET column1=value1, columnN,valueN;
```

```sql
UPDATE <table> SET column1=value1, columnN,valueN
WHERE condition;
```

[MySQL Documenation](https://web.archive.org/web/20200710113234/https://dev.mysql.com/doc/refman/8.0/en/update.html)

```sql
mysql> use lab5;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab5 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person
    -> WHERE personID=10;
+----------+-------+------+------+-----------+
| personID | name  | age  | sex  | isStudent |
+----------+-------+------+------+-----------+
|       10 | Tommy | NULL | M    |         0 |
+----------+-------+------+------+-----------+
1 row in set (0.00 sec)
```

- **inserting** **row** - record - tuple - value - Tommy - did **not** have **all** **data** - **command** - **UPDATE** - followed by **table** - entity - relation - person - **keyword** - **SET** - **column** - attribute - field - age - **value** - to be **updated** [1]

- **important** to **apply** a **constraint** **otherwise** **all** **rows** - records - tuples - in the **table** - entity - relation - will get **updated** [1]

```sql
mysql> UPDATE person
    -> SET age=23
    -> WHERE personID=10;
Query OK, 1 row affected (0.01 sec)
Rows matched: 1  Changed: 1  Warnings: 0
```

```sql
mysql> SELECT *
    -> FROM person
    -> WHERE personID=10;
+----------+-------+------+------+-----------+
| personID | name  | age  | sex  | isStudent |
+----------+-------+------+------+-----------+
|       10 | Tommy |   23 | M    |         0 |
+----------+-------+------+------+-----------+
1 row in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+----------+------+------+-----------+
| personID | name     | age  | sex  | isStudent |
+----------+----------+------+------+-----------+
|        1 | John     |   23 | M    |         1 |
|        2 | Mary     |   30 | F    |         0 |
|        3 | Tom      | NULL | M    |         0 |
|        4 | Alan     |   18 | M    |         1 |
|        5 | Laura    |   17 | F    |         1 |
|        6 | Bob      |   18 | M    |         0 |
|        7 | Johnny   |   23 | M    |         1 |
|        8 | Mary     |   30 | F    |         0 |
|        9 | Jonathan |   23 | M    |         0 |
|       10 | Tommy    |   23 | M    |         0 |
+----------+----------+------+------+-----------+
9 rows in set (0.00 sec)
```

- taking into account the **existing** **values** of a **column** - attribute - field - increase column - attribute - field - age - **increase** each persons **age** by one - **given** **no** **constraint** - without **clause** - **WHERE** - update will **apply** to **each** **row** - record - tuple - in the **table** - entity - relation [1]

```sql
mysql> UPDATE person
    -> SET age=age+1;
Query OK, 9 rows affected (0.01 sec)
Rows matched: 10  Changed: 9  Warnings: 0
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+----------+------+------+-----------+
| personID | name     | age  | sex  | isStudent |
+----------+----------+------+------+-----------+
|        1 | John     |   24 | M    |         1 |
|        2 | Mary     |   31 | F    |         0 |
|        3 | Tom      | NULL | M    |         0 |
|        4 | Alan     |   19 | M    |         1 |
|        5 | Laura    |   18 | F    |         1 |
|        6 | Bob      |   19 | M    |         0 |
|        7 | Johnny   |   24 | M    |         1 |
|        8 | Mary     |   31 | F    |         0 |
|        9 | Jonathan |   24 | M    |         0 |
|       10 | Tommy    |   24 | M    |         0 |
+----------+----------+------+------+-----------+
10 rows in set (0.00 sec)
```

- update only applied to nine columns - attributes - fields - given row - record - tuple - Tom - column - attribute - field - age - value - NULL [1]

```sql
mysql> SELECT *
    -> FROM person
    -> WHERE personID=3;
+----------+------+------+------+-----------+
| personID | name | age  | sex  | isStudent |
+----------+------+------+------+-----------+
|        3 | Tom  | NULL | M    |         0 |
+----------+------+------+------+-----------+
1 row in set (0.00 sec)
```

- update table - entity - relation - person - include - Mr. - Ms. - in each row - record - tuple - in the column - attribute - field - name [1]

- first check current row - record - tuple - value - before setting to a new value [1]

- **function** - **IF** - **three** **expressions** - i) **first** expression - **test** for - **True** - **False** - column - attribute - field - sex - equals - M - ii) **second** expression - **value** to **return** if the **first** expression - **True**  - Mr. - iii) **third** expression - **value** to **return** if the **first** expression - **False** - Ms. - value returned from - function - IF - either - Mr. - Ms. [1]

```sql
IF(sex="M","Mr.","Ms.")
```

 - **function** - **CONCAT** - **joins** **two** **strings** together - **two** - **parameters** - i) **first** - **result** of running function - **IF** - ii) **second** - the **original** **column** - attribute - field - name [1]
 
```sql
CONCAT(IF(sex="M","Mr.","Ms."),name)
```

```sql
mysql> UPDATE person
    -> SET name=CONCAT(IF(sex="M","Mr.","Ms."),name);
Query OK, 10 rows affected (0.01 sec)
Rows matched: 10  Changed: 10  Warnings: 0
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------------+------+------+-----------+
| personID | name        | age  | sex  | isStudent |
+----------+-------------+------+------+-----------+
|        1 | Mr.John     |   24 | M    |         1 |
|        2 | Ms.Mary     |   31 | F    |         0 |
|        3 | Mr.Tom      | NULL | M    |         0 |
|        4 | Mr.Alan     |   19 | M    |         1 |
|        5 | Ms.Laura    |   18 | F    |         1 |
|        6 | Mr.Bob      |   19 | M    |         0 |
|        7 | Mr.Johnny   |   24 | M    |         1 |
|        8 | Ms.Mary     |   31 | F    |         0 |
|        9 | Mr.Jonathan |   24 | M    |         0 |
|       10 | Mr.Tommy    |   24 | M    |         0 |
+----------+-------------+------+------+-----------+
10 rows in set (0.00 sec)
```

***
# END